Enums/ЛБ_ВидыОперацийПриказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийПриказы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Базовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменитьВИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ВводПриказаВДействие/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидОперации") Тогда 
		ВидОперации = Параметры.ВидОперации;
	Иначе
		ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый;
	КонецЕсли;	 
	Если ВидОперации = Перечисления.ЛБ_ВидыОперацийПриказы.Базовый Тогда
		Элементы.ДатаОкончанияДействияПриказа.Видимость = ложь;
	КонецЕсли;	
	Если Параметры.Свойство("НомерПриказа") Тогда
		НомерПриказа = Параметры.НомерПриказа;
	КонецЕсли; 
	Если Параметры.Свойство("ДатаПриказа") Тогда
		ДатаПриказа = Параметры.ДатаПриказа;
	КонецЕсли;
	ДатаНачалаДействияПриказа = ДатаПриказа;
КонецПроцедуры

&НаКлиенте
Процедура ВвестиВДействие(Команда)  
	ВсеОК = Истина;	
	Если НЕ ПроверитьЗаполнение() Тогда
		ВсеОК = ложь;
	Иначе    	
		Если ДатаПриказа > ДатаНачалаДействияПриказа Тогда
			Сообщить("Дата приказа не может быть больше даты начала действия приказа!");
			ВсеОК = ложь;
		КонецЕсли;   
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийПриказы.Акция") Тогда  
			Если ДатаОкончанияДействияПриказа = Дата(1,1,1) Тогда
				Сообщить("Не выбрана дата окончания действия акции!");
			    ВсеОК = ложь;
			КонецЕсли;  
			Если ДатаНачалаДействияПриказа > ДатаОкончанияДействияПриказа Тогда
				Сообщить("Дата окончания действия акции не может быть меньше даты начала действия приказа по акции!");
				ВсеОК = ложь;
			КонецЕсли;   
		КонецЕсли;	
	КонецЕсли;	
	
	Если ВсеОК Тогда
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("НомерПриказа", НомерПриказа);
		СтруктураВозврата.Вставить("ДатаПриказа", ДатаПриказа);
		СтруктураВозврата.Вставить("ДатаНачалаДействияПриказа", ДатаНачалаДействияПриказа); 
		СтруктураВозврата.Вставить("ДатаОкончанияДействияПриказа", ДатаОкончанияДействияПриказа);  
		
		Закрыть(СтруктураВозврата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
